---
kind: type
id: T:Autodesk.Revit.DB.Visual.WaterType
source: html/e2ec359e-952d-b793-f49c-8dbca2a171d8.htm
---
# Autodesk.Revit.DB.Visual.WaterType

The enumerated type representing the permitted values for the asset property "WaterType" from the "Water" schema.

## Syntax (C#)
```csharp
public enum WaterType
```